'''
사칙 연산자
'''

def main():
    x = 3
    y = 4

    print("{0} + {1} = {2}".format(x, y, (x + y))) #3 + 4 = 7
    print("{0} - {1} = {2}".format(x, y, (x - y))) #3 - 4 = -1
    print("{0} * {1} = {2}".format(x, y, (x * y))) #3 * 4 = 12
    print("{0} / {1} = {2}".format(x, y, (x / y))) #3 / 4 = 0.75 (몫만 나오지 않음)

    # 문자열 * 숫자 : 문자열을 숫자만큼 반복 출력
    print('-' * 45) #---------------------------------------------

    # ** : x의 y제곱을 나타내는 연산자
    print("{0} ** {1} = {2}".format(x, y, (x ** y))) #3 ** 4 = 81

    # % : 나머지 연산자
    print("{0} % {1} = {2}".format(x, y, (x % y)))  #3 % 4 = 3

    # // : 몫 연산자
    x = 7
    y = 4
    print("{0} // {1} = {2}".format(x, y, (x // y))) #7 // 4 = 1 (1.75에서 정수값만 리턴)
    print("{0} / {1} = {2}".format(x, y, (x / y))) #7 / 4 = 1.75


main()